nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_evtg.h
/*! @brief EVTG input index. */
typedef enum _evtg_input_index
{
    kEVTG_InputA = 0U, /*!< EVTG input A. */
    kEVTG_InputB = 1U, /*!< EVTG input B. */
    kEVTG_InputC = 2U, /*!< EVTG input C. */
    kEVTG_InputD = 3U  /*!< EVTG input D. */
} evtg_input_index_t;

/*! @brief EVTG AOI index. */
typedef enum _evtg_aoi_index
{
    kEVTG_AOI0 = 0U, /*!< EVTG AOI index 0. */
    kEVTG_AOI1 = 1U  /*!< EVTG AOI index 1. */
} evtg_aoi_index_t;

/*! @brief EVTG AOI product term index. */
typedef enum _evtg_aoi_product_term
{
    kEVTG_ProductTerm0 = 0U, /*!< EVTG AOI product term index 0. */
    kEVTG_ProductTerm1 = 1U, /*!< EVTG AOI product term index 1. */
    kEVTG_ProductTerm2 = 2U, /*!< EVTG AOI product term index 2. */
    kEVTG_ProductTerm3 = 3U  /*!< EVTG AOI product term index 3. */
} evtg_aoi_product_term_t;

/*! @brief EVTG input configuration. */
typedef enum _evtg_aoi_input_config
{
    kEVTG_Input_LogicZero  = 0U, /*!< Force input in product term to a logical zero. */
    kEVTG_Input_DirectPass = 1U, /*!< Pass input in product term. */
    kEVTG_Input_Complement = 2U, /*!< Complement input in product term. */
    kEVTG_Input_LogicOne   = 3U  /*!< Force input in product term to a logical one. */
} evtg_aoi_input_config_t;

/*! @brief EVTG AOI Output Filter Sample Count. */
typedef enum _evtg_aoi_outfilter_count
{
    kEVTG_AOIOutFilter_SampleCount3  = 0, /*!< EVTG AOI output filter sample count is 3. */
    kEVTG_AOIOutFilter_SampleCount4  = 1, /*!< EVTG AOI output filter sample count is 4. */
    kEVTG_AOIOutFilter_SampleCount5  = 2, /*!< EVTG AOI output filter sample count is 5. */
    kEVTG_AOIOutFilter_SampleCount6  = 3, /*!< EVTG AOI output filter sample count is 6. */
    kEVTG_AOIOutFilter_SampleCount7  = 4, /*!< EVTG AOI output filter sample count is 7. */
    kEVTG_AOIOutFilter_SampleCount8  = 5, /*!< EVTG AOI output filter sample count is 8. */
    kEVTG_AOIOutFilter_SampleCount9  = 6, /*!< EVTG AOI output filter sample count is 9. */
    kEVTG_AOIOutFilter_SampleCount10 = 7  /*!< EVTG AOI output filter sample count is 10. */
} evtg_aoi_outfilter_count_t;

/*!
 * @brief EVTG output feedback override control mode. When FF is configured as JK-FF mode,
 *        need EVTG_OUTA feedback to EVTG input and replace one of the four inputs.
 */
typedef enum _evtg_outfdbk_override_input
{
    kEVTG_Output_OverrideInputA = 0U, /*!< Replace input A. */
    kEVTG_Output_OverrideInputB = 1U, /*!< Replace input B. */
    kEVTG_Output_OverrideInputC = 2U, /*!< Replace input C. */
    kEVTG_Output_OverrideInputD = 3U, /*!< Replace input D. */
} evtg_outfdbk_override_input_t;

/*! @brief EVTG flip flop mode configuration. */
typedef enum _evtg_flipflop_mode
{
    kEVTG_FFMode_Bypass = 0U,    /*!< Bypass mode (default).In this mode, user can choose to enable
                                    or disable input sync logic and filter function. */
    kEVTG_FFMode_RSTrigger = 1U, /*!< RS trigger mode. In this mode, user can choose to enable
                                    or disable input sync logic and filter function. */
    kEVTG_FFMode_TFF = 2U,       /*!< T-FF mode. In this mode, input sync or filter has to be enabled
                                    to remove the possible glitch.*/
    kEVTG_FFMode_DFF = 3U,       /*!< D-FF mode. In this mode, input sync or filter has to be enabled
                                    to remove the possible glitch.*/
    kEVTG_FFMode_JKFF = 4U,      /*!< JK-FF mode. In this mode, input sync or filter has to be enabled
                                    to remove the possible glitch.*/
    kEVTG_FFMode_Latch = 5U      /*!< Latch mode. In this mode, input sync or filter has to be enabled
                                    to remove the possible glitch.*/
} evtg_flipflop_mode_t;

/*! @brief EVTG flip-flop initial value. */
typedef enum _evtg_flipflop_initoutput
{
    kEVTG_FF_InitOut0 = 0U, /*!< Configure the positive output of flip-flop as 0. */
    kEVTG_FF_InitOut1 = 1U, /*!< Configure the positive output of flip-flop as 1. */
} evtg_flipflop_init_output_t;

/*! @brief The structure for configuring an AOI output filter sample.
 *
 * AOI output filter sample count represent the number of consecutive samples that must agree prior to the AOI output
 * filter accepting an transition.
 * AOI output filter sample period represent the sampling period (in IP bus clock cycles) of the AOI output signals.
 * Each AOI output is sampled multiple times at the rate specified by this period.
 *
 * For the modes with Filter function enabled, filter delay is "(FILT_CNT + 3) x FILT_PER + 2".
 *
 */
typedef struct _evtg_aoi_outfilter_config
{
    evtg_aoi_outfilter_count_t eSampleCount; /*!< EVTG AOI output filter sample count.
                                                refer to @ref _evtg_aoi_outfilter_count. */
    uint8_t u8SamplePeriod;                  /*!< EVTG AOI output filter sample period, within 0~255. If sample period
                                                value is 0x00 (default), then the input filter is bypassed. */
} evtg_aoi_outfilter_config_t;

/*! @brief The structure for configuring an AOI product term. */
typedef struct _evtg_aoi_product_term_config
{
    evtg_aoi_input_config_t eAInput : 2; /*!< Input A configuration. */
    evtg_aoi_input_config_t eBInput : 2; /*!< Input B configuration. */
    evtg_aoi_input_config_t eCInput : 2; /*!< Input C configuration. */
    evtg_aoi_input_config_t eDInput : 2; /*!< Input D configuration. */
} evtg_aoi_product_term_config_t;

/*! @brief EVTG AOI configuration structure. */
typedef struct _evtg_aoi_config
{
    /* AOI Output Filter configuration. */
    evtg_aoi_outfilter_config_t sAOIOutFilterConfig; /*!< EVTG AOI output filter sample
                                                        configuration structure. */

    /* Product term configuration. */
    evtg_aoi_product_term_config_t sProductTerm0; /*!< Configure AOI product term0. */
    evtg_aoi_product_term_config_t sProductTerm1; /*!< Configure AOI product term1. */
    evtg_aoi_product_term_config_t sProductTerm2; /*!< Configure AOI product term2. */
    evtg_aoi_product_term_config_t sProductTerm3; /*!< Configure AOI product term3. */
} evtg_aoi_config_t;

/*! @brief EVTG configuration covering all configurable fields. */
typedef struct _evtg_config
{
    /* Input configuration. */
    bool bEnableInputASync : 1; /*!< Enable/Disable EVTG A input synchronous with bus clk. */
    bool bEnableInputBSync : 1; /*!< Enable/Disable EVTG B input synchronous with bus clk. */
    bool bEnableInputCSync : 1; /*!< Enable/Disable EVTG C input synchronous with bus clk. */
    bool bEnableInputDSync : 1; /*!< Enable/Disable EVTG D input synchronous with bus clk. */
    evtg_outfdbk_override_input_t eOutfdbkOverideinput : 2; /*!< EVTG output feedback to EVTG input
                                                               and replace one of the four inputs. */

    /* Flip-flop configuration. */
    evtg_flipflop_mode_t eFlipflopMode : 3; /*!< Flip-Flop can be configured as one of Bypass mode, RS trigger mode,
                                               T-FF mode, D-FF mode, JK-FF mode, Latch mode. */
    bool bEnableFlipflopInitOutput : 1;     /*!< Flip-flop initial output value enable/disable. */
    evtg_flipflop_init_output_t eFlipflopInitOutputValue : 1; /*!< Flip-flop initial output value configuration. */

#if defined(FSL_FEATURE_EVTG_HAS_FORCE_BYPASS_FLIPFLOP) && FSL_FEATURE_EVTG_HAS_FORCE_BYPASS_FLIPFLOP
    bool bEnableForceBypassFlipFlopAOI0 : 1; /*!< Enable/Disable force bypass Flip-Flop and route the AOI_0(Filter_0)
                                                value directly to EVTG_OUTA */
    bool bEnableForceBypassFlipFlopAOI1 : 1; /*!< Enable/Disable force bypass Flip-Flop and route the AOI_1(Filter_1)
                                                value directly to EVTG_OUTB */
#endif

    /* AOI configuration. */
    evtg_aoi_config_t sAOI0Config; /*!< Configure EVTG AOI0. */
    evtg_aoi_config_t sAOI1Config; /*!< Configure EVTG AOI1. */
} evtg_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization Interfaces
 * @{
 */

/*!
 * @brief Initialize EVTG with a user configuration structure.
 *
 * @param base       EVTG base address.
 * @param eEvtgIndex EVTG instance index.
 * @param psConfig   EVTG initial configuration structure pointer.
 */
void EVTG_Init(EVTG_Type *base, evtg_index_t eEvtgIndex, evtg_config_t *psConfig);

/*!
 * @brief Loads default values to the EVTG configuration structure.
 *
 *  The purpose of this API is to initialize the configuration structure to default value for @ref EVTG_Init()
 *  to use.
 *  The Flip-Flop can be configured as Bypass mode, RS trigger mode, T-FF mode, D-FF mode, JK-FF mode, Latch mode.
 *  Please check RM INTC chapter for more details.
 *
 * @param psConfig      EVTG initial configuration structure pointer.
 * @param eFlipflopMode EVTG flip flop mode. see @ ref _evtg_flipflop_mode
 */
static inline void EVTG_GetDefaultConfig(evtg_config_t *psConfig, evtg_flipflop_mode_t eFlipflopMode)
{
    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    switch (eFlipflopMode)
    {
        case kEVTG_FFMode_Bypass:

