nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_evtg.h
            /*
             * In this mode, filp-flop will be passed, The two AOI expressions "AOI_0" and "AOI_1"
             * will be directly assigned to EVTG outputs(EVTG_OUTA and EVTG_OUTB).
             *
             * In this mode, user can choose to enable or disable input sync logic and filter function.
             * Here disable both input sync logic and filter function.
             */
            psConfig->eFlipflopMode = kEVTG_FFMode_Bypass;

            psConfig->bEnableInputASync = false;
            psConfig->bEnableInputBSync = false;
            psConfig->bEnableInputCSync = false;
            psConfig->bEnableInputDSync = false;

            break;

        case kEVTG_FFMode_RSTrigger:

            /*
             * In this mode, AOI_0 expression is Reset port, and AOI_1 is Set port. Both are active
             * high. When "R"(Reset) is high, whatever "S"(Set) is, EVTG_OUTA will be "0". When "R" is
             * low and "S" is high, EVTG_OUTA will be "1". If both "R" and "S" are low, EVTG output
             * will be kept. EVTG_OUTB is always the complement of EVTG_OUTA.
             *
             * In this mode, user can choose to enable or disable input sync logic and filter function.
             * Here disable both input sync logic and filter function.
             */
            psConfig->eFlipflopMode = kEVTG_FFMode_RSTrigger;

            psConfig->bEnableInputASync = false;
            psConfig->bEnableInputBSync = false;
            psConfig->bEnableInputCSync = false;
            psConfig->bEnableInputDSync = false;

            break;

        case kEVTG_FFMode_TFF:

            /*
             * In this mode, AOI_0 expression is T port of T-FF, AOI_1 is CLK port. When T assert,
             * the Q port (EVTG_OUTA) will turnover at the rising edge of "CLK". When T dis-assert,
             * Q(EVTG_OUTA) will be kept. EVTG_OUTB is always the complement of EVTG_OUTA.
             *
             * In this mode, input sync or filter has to be enabled to remove the possible glitch.
             * Here input sync is enabled, filter is disabled. User could override corresponding fields
             * depends on the actual user case to choose to enable or disable input sync logic and filter
             * function.
             */
            psConfig->eFlipflopMode = kEVTG_FFMode_TFF;

            psConfig->bEnableInputASync = true;
            psConfig->bEnableInputBSync = true;
            psConfig->bEnableInputCSync = true;
            psConfig->bEnableInputDSync = true;

            break;

        case kEVTG_FFMode_JKFF:

            /*
             * In general, JK Flip-Flop have four input ports: J, K , Q and CLK(Q is output of Flip-Flop).
             * And the logical expression is J&~Q | ~K&Q;  Here we implement the logic expression by AOI
             * so that we can reuse the D-FF to implement JK-FF. Suppose we set EVTG input "An" as "J" port,
             * "Cn" as "K" port, "Dn" as "CLK" port, and "Q" port of FF feed back and override "Bn".
             * According to the JK logic expression, the AOI_0 expression will be "An&~Bn | Bn&~Cn",
             * AOI_1 expression will be "Dn".
             *
             * In this mode, input sync or filter has to be enabled to remove the possible glitch.
             * Here input sync is enabled, filter is disabled. User could override corresponding fields
             * depends on the actual user case to choose to enable or disable input sync logic and filter
             * function.
             *
             * When FF Mode is configured as JK-FF mode, need EVTG_OUTA feedback to EVTG input and replace
             * one of the four inputs. Here input Bn is replaced, represents which EVTG input(EVTG_OUTA)
             * is replaced by FF output.
             */
            psConfig->eFlipflopMode        = kEVTG_FFMode_JKFF;
            psConfig->eOutfdbkOverideinput = kEVTG_Output_OverrideInputB;

            psConfig->bEnableInputASync = true;
            psConfig->bEnableInputBSync = true;
            psConfig->bEnableInputCSync = true;
            psConfig->bEnableInputDSync = true;

            break;

        case kEVTG_FFMode_Latch:

            /*
             * In this mode, AOI_0 expression is D port, AOI_1 is CLK port. Different from D-FF
             * mode, in Latch mode, D port will be passed only when CLK is high, and output will be
             * kept when CLK is low. EVTG_OUTB is always the complement of EVTG_OUTA.
             *
             * In this mode, input sync or filter has to be enabled to remove the possible glitch.
             * Here input sync is enabled, filter is disabled. User could override corresponding fields
             * depends on the actual user case to choose to enable or disable input sync logic and filter
             * function.
             */
            psConfig->eFlipflopMode = kEVTG_FFMode_Latch;

            psConfig->bEnableInputASync = true;
            psConfig->bEnableInputBSync = true;
            psConfig->bEnableInputCSync = true;
            psConfig->bEnableInputDSync = true;

            break;

        default:
            assert(false);
    }
    /* User could choose to enable or disable Flip-flop initial output value. */
    psConfig->bEnableFlipflopInitOutput = false;
    psConfig->eFlipflopInitOutputValue  = kEVTG_FF_InitOut0;

    /* User could choose to override this fields to enable filter function. */
    psConfig->sAOI0Config.sAOIOutFilterConfig.eSampleCount   = kEVTG_AOIOutFilter_SampleCount3;
    psConfig->sAOI0Config.sAOIOutFilterConfig.u8SamplePeriod = 0;

    psConfig->sAOI1Config.sAOIOutFilterConfig.eSampleCount   = kEVTG_AOIOutFilter_SampleCount3;
    psConfig->sAOI1Config.sAOIOutFilterConfig.u8SamplePeriod = 0;

#if defined(FSL_FEATURE_EVTG_HAS_FORCE_BYPASS_FLIPFLOP) && FSL_FEATURE_EVTG_HAS_FORCE_BYPASS_FLIPFLOP
    psConfig->bEnableForceBypassFlipFlopAOI0 = false;
    psConfig->bEnableForceBypassFlipFlopAOI1 = false;
#endif

