nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_evtg.h
    /*
     * For JK-FF Mode, Here we implement the logic expression by AOI so that we can reuse the
     * D-FF to implement JK-FF. Suppose we set EVTG input "An" as "J" port, "Cn" as "K" port, "Dn"
     * as "CLK" port, and "Q" port of FF feed back and override "Bn". According to the JK logic
     * expression, the AOI_0 expression will be "An&~Bn | Bn&~Cn", AOI_1 expression will be "Dn".
     *
     * For other FF Mode, the default input here is logical 0. User can configure to produce a logical 0
     * or 1 or pass the true or complement of the selected event input according to their requirement.
     */
    if (kEVTG_FFMode_JKFF == eFlipflopMode)
    {
        psConfig->sAOI0Config.sProductTerm0.eAInput = kEVTG_Input_DirectPass;
        psConfig->sAOI0Config.sProductTerm0.eBInput = kEVTG_Input_Complement;
        psConfig->sAOI0Config.sProductTerm0.eCInput = kEVTG_Input_LogicOne;
        psConfig->sAOI0Config.sProductTerm0.eDInput = kEVTG_Input_LogicOne;

        psConfig->sAOI0Config.sProductTerm1.eAInput = kEVTG_Input_LogicOne;
        psConfig->sAOI0Config.sProductTerm1.eBInput = kEVTG_Input_DirectPass;
        psConfig->sAOI0Config.sProductTerm1.eCInput = kEVTG_Input_Complement;
        psConfig->sAOI0Config.sProductTerm1.eDInput = kEVTG_Input_LogicOne;

        psConfig->sAOI0Config.sProductTerm2.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI0Config.sProductTerm3.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm0.eAInput = kEVTG_Input_LogicOne;
        psConfig->sAOI1Config.sProductTerm0.eBInput = kEVTG_Input_LogicOne;
        psConfig->sAOI1Config.sProductTerm0.eCInput = kEVTG_Input_LogicOne;
        psConfig->sAOI1Config.sProductTerm0.eDInput = kEVTG_Input_DirectPass;

        psConfig->sAOI1Config.sProductTerm1.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm2.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm3.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eDInput = kEVTG_Input_LogicZero;
    }
    else
    {
        psConfig->sAOI0Config.sProductTerm0.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm0.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm0.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm0.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI0Config.sProductTerm1.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm1.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm1.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm1.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI0Config.sProductTerm2.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm2.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI0Config.sProductTerm3.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI0Config.sProductTerm3.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm0.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm0.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm0.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm0.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm1.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm1.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm2.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm2.eDInput = kEVTG_Input_LogicZero;

        psConfig->sAOI1Config.sProductTerm3.eAInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eBInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eCInput = kEVTG_Input_LogicZero;
        psConfig->sAOI1Config.sProductTerm3.eDInput = kEVTG_Input_LogicZero;
    }
}
/* @} */

/*!
 * @name Force Init Flipflop Interfaces
 * @{
 */

/*!
 * @brief Force Flip-flop initial output value to be presented on flip-flop positive output.
 *
 * @param base                EVTG base address.
 * @param eEvtgIndex          EVTG instance index.
 * @param eFlipflopInitOutput EVTG flip-flop initial output control.
 *                            see @ref _evtg_flipflop_initoutput
 */
static inline void EVTG_ForceFlipflopInitOutput(EVTG_Type *base,
                                                evtg_index_t eEvtgIndex,
                                                evtg_flipflop_init_output_t eFlipflopInitOutputValue)
{
    base->EVTG_INST[eEvtgIndex].EVTG_CTRL &= (~EVTG_EVTG_CTRL_FF_INIT_MASK);
    base->EVTG_INST[eEvtgIndex].EVTG_CTRL |= EVTG_EVTG_CTRL_FF_INIT((uint16_t)eFlipflopInitOutputValue);
    /* INIT_EN bit should be set after FF_INIT is set. */
    base->EVTG_INST[eEvtgIndex].EVTG_CTRL |= EVTG_EVTG_CTRL_INIT_EN_MASK;
}
/* @} */

/*!
 * @name Input Interfaces
 * @{
 */
/*!
 * @brief Configure each input value of AOI product term. Each selected input term in
 *        each product term can be configured to produce a logical 0 or 1 or pass the
 *        true or complement of the selected event input. Adapt to some simple aoi
 *        expressions.
 *
 * @param base         EVTG base address.
 * @param eEvtgIndex   EVTG instance index.
 * @param eAOIIndex    EVTG AOI index. see enum ref _evtg_aoi_index
 * @param eProductTerm EVTG product term index.
 * @param eInputIndex  EVTG input index.
 * @param eInput       EVTG input configuration with enum @ref _evtg_aoi_input_config.
 */
static inline void EVTG_SetProductTermInput(EVTG_Type *base,
                                            evtg_index_t eEvtgIndex,
                                            evtg_aoi_index_t eAOIIndex,
                                            evtg_aoi_product_term_t eProductTerm,
                                            evtg_input_index_t eInputIndex,
                                            evtg_aoi_input_config_t eInput)
{
    if (kEVTG_AOI0 == eAOIIndex)
    {
        if ((eProductTerm == kEVTG_ProductTerm0) || (eProductTerm == kEVTG_ProductTerm1))
        {
            base->EVTG_INST[eEvtgIndex].EVTG_AOI0_BFT01 &=
                (~(3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
            base->EVTG_INST[eEvtgIndex].EVTG_AOI0_BFT01 |=
                (((uint16_t)(((uint16_t)(eInput))
                             << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U)))) &
                 (3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
        }
        else
        {
            base->EVTG_INST[eEvtgIndex].EVTG_AOI0_BFT23 &=
                (~(3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
            base->EVTG_INST[eEvtgIndex].EVTG_AOI0_BFT23 |=
                (((uint16_t)(((uint16_t)(eInput))
                             << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U)))) &
                 (3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
        }
    }
    else if (kEVTG_AOI1 == eAOIIndex)
    {
        if ((eProductTerm == kEVTG_ProductTerm0) || (eProductTerm == kEVTG_ProductTerm1))
        {
            base->EVTG_INST[eEvtgIndex].EVTG_AOI1_BFT01 &=
                (~(3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
            base->EVTG_INST[eEvtgIndex].EVTG_AOI1_BFT01 |=
                (((uint16_t)(((uint16_t)(eInput))
                             << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U)))) &
                 (3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
        }
        else
        {
            base->EVTG_INST[eEvtgIndex].EVTG_AOI1_BFT23 &=
                (~(3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
            base->EVTG_INST[eEvtgIndex].EVTG_AOI1_BFT23 |=
                (((uint16_t)(((uint16_t)(eInput))
                             << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U)))) &
                 (3U << ((3U - ((uint8_t)eInputIndex)) * 2U + (((3U - (uint8_t)eProductTerm) % 2U) * 8U))));
        }
    }
}

/*!
 * @brief Configure AOI product term by initializing the product term
 *        configuration structure.
 *
 * @param base                EVTG base address.
 * @param eEvtgIndex          EVTG instance index.
 * @param eAOIIndex           EVTG AOI index. see enum @ref _evtg_aoi_index
 * @param eProductTerm        EVTG AOI product term index.
 * @param psProductTermConfig Pointer to EVTG product term configuration structure.
 *                            see ref _evtg_aoi_product_term_config
 */
void EVTG_ConfigAOIProductTerm(EVTG_Type *base,
                               evtg_index_t eEvtgIndex,
                               evtg_aoi_index_t eAOIIndex,
                               evtg_aoi_product_term_t eProductTerm,
                               evtg_aoi_product_term_config_t *psProductTermConfig);

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_EVTG_H_ */
